; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	satellite4 - satellite
	instrument10 - instrument
	spectrograph0 - mode
	infrared3 - mode
	thermograph1 - mode
	image4 - mode
	infrared2 - mode
	Star0 - direction
	GroundStation8 - direction
	GroundStation6 - direction
	GroundStation25 - direction
	GroundStation1 - direction
	GroundStation38 - direction
	Star2 - direction
	GroundStation3 - direction
	Star11 - direction
	GroundStation39 - direction
	GroundStation46 - direction
	Star7 - direction
	Star41 - direction
	GroundStation29 - direction
	Star35 - direction
	Star24 - direction
	Star36 - direction
	GroundStation42 - direction
	GroundStation45 - direction
	Star4 - direction
	Star48 - direction
	Star30 - direction
	Star49 - direction
	Star21 - direction
	GroundStation44 - direction
	Star12 - direction
	GroundStation37 - direction
	GroundStation19 - direction
	GroundStation15 - direction
	Star16 - direction
	GroundStation32 - direction
	Star18 - direction
	Star23 - direction
	Star26 - direction
	GroundStation40 - direction
	GroundStation33 - direction
	GroundStation14 - direction
	Star34 - direction
	Star28 - direction
	GroundStation27 - direction
	Star20 - direction
	Star31 - direction
	GroundStation17 - direction
	Star5 - direction
	Star43 - direction
	Star9 - direction
	GroundStation13 - direction
	GroundStation22 - direction
	GroundStation10 - direction
	GroundStation47 - direction
	Planet50 - direction
	Planet51 - direction
	Planet52 - direction
	Phenomenon53 - direction
	Planet54 - direction
	Star55 - direction
	Star56 - direction
	Planet57 - direction
	Planet58 - direction
	Planet59 - direction
	Planet60 - direction
	Phenomenon61 - direction
	Star62 - direction
	Star63 - direction
	Phenomenon64 - direction
	Star65 - direction
	Planet66 - direction
	Star67 - direction
	Planet68 - direction
	Phenomenon69 - direction
	Phenomenon70 - direction
	Star71 - direction
	Phenomenon72 - direction
	Phenomenon73 - direction
	Star74 - direction
	Planet75 - direction
	Phenomenon76 - direction
	Star77 - direction
	Planet78 - direction
	Planet79 - direction
	Phenomenon80 - direction
	Star81 - direction
	Phenomenon82 - direction
	Phenomenon83 - direction
	Phenomenon84 - direction
)
(:init
	(supports instrument0 infrared2)
	(supports instrument0 infrared3)
	(calibration_target instrument0 GroundStation25)
	(calibration_target instrument0 GroundStation6)
	(calibration_target instrument0 GroundStation1)
	(calibration_target instrument0 Star48)
	(calibration_target instrument0 Star5)
	(calibration_target instrument0 Star20)
	(calibration_target instrument0 GroundStation44)
	(calibration_target instrument0 Star7)
	(calibration_target instrument0 Star23)
	(calibration_target instrument0 Star4)
	(calibration_target instrument0 Star35)
	(calibration_target instrument0 Star36)
	(calibration_target instrument0 Star34)
	(calibration_target instrument0 GroundStation8)
	(calibration_target instrument0 GroundStation37)
	(calibration_target instrument0 Star16)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation13)
	(calibration_target instrument1 Star30)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star0)
	(supports instrument2 infrared2)
	(calibration_target instrument2 Star31)
	(calibration_target instrument2 GroundStation15)
	(calibration_target instrument2 Star36)
	(calibration_target instrument2 Star34)
	(calibration_target instrument2 GroundStation27)
	(calibration_target instrument2 Star18)
	(calibration_target instrument2 Star24)
	(calibration_target instrument2 GroundStation1)
	(calibration_target instrument2 GroundStation10)
	(calibration_target instrument2 Star28)
	(calibration_target instrument2 Star43)
	(calibration_target instrument2 Star2)
	(calibration_target instrument2 Star26)
	(calibration_target instrument2 Star16)
	(calibration_target instrument2 Star11)
	(supports instrument3 image4)
	(calibration_target instrument3 Star34)
	(calibration_target instrument3 GroundStation13)
	(calibration_target instrument3 Star18)
	(calibration_target instrument3 GroundStation19)
	(calibration_target instrument3 Star31)
	(calibration_target instrument3 Star2)
	(calibration_target instrument3 GroundStation38)
	(calibration_target instrument3 Star41)
	(calibration_target instrument3 GroundStation40)
	(calibration_target instrument3 GroundStation42)
	(on_board instrument2 satellite1)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet52)
	(supports instrument4 infrared2)
	(supports instrument4 thermograph1)
	(calibration_target instrument4 Star11)
	(calibration_target instrument4 GroundStation3)
	(calibration_target instrument4 GroundStation17)
	(supports instrument5 infrared3)
	(supports instrument5 spectrograph0)
	(supports instrument5 image4)
	(calibration_target instrument5 GroundStation29)
	(calibration_target instrument5 GroundStation27)
	(calibration_target instrument5 Star41)
	(calibration_target instrument5 GroundStation40)
	(calibration_target instrument5 Star35)
	(calibration_target instrument5 GroundStation37)
	(calibration_target instrument5 Star21)
	(calibration_target instrument5 Star30)
	(calibration_target instrument5 Star7)
	(calibration_target instrument5 GroundStation46)
	(calibration_target instrument5 GroundStation39)
	(calibration_target instrument5 Star16)
	(calibration_target instrument5 Star34)
	(calibration_target instrument5 GroundStation44)
	(calibration_target instrument5 GroundStation17)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star43)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 GroundStation42)
	(calibration_target instrument6 Star35)
	(calibration_target instrument6 GroundStation44)
	(calibration_target instrument6 Star28)
	(calibration_target instrument6 Star20)
	(supports instrument7 image4)
	(supports instrument7 infrared3)
	(calibration_target instrument7 Star26)
	(calibration_target instrument7 Star5)
	(calibration_target instrument7 Star16)
	(calibration_target instrument7 Star4)
	(calibration_target instrument7 GroundStation45)
	(calibration_target instrument7 GroundStation42)
	(calibration_target instrument7 Star36)
	(calibration_target instrument7 GroundStation44)
	(calibration_target instrument7 Star24)
	(calibration_target instrument7 Star48)
	(supports instrument8 spectrograph0)
	(supports instrument8 thermograph1)
	(supports instrument8 infrared3)
	(calibration_target instrument8 GroundStation19)
	(calibration_target instrument8 GroundStation37)
	(calibration_target instrument8 Star12)
	(calibration_target instrument8 GroundStation44)
	(calibration_target instrument8 GroundStation15)
	(calibration_target instrument8 Star21)
	(calibration_target instrument8 Star49)
	(calibration_target instrument8 Star30)
	(calibration_target instrument8 GroundStation10)
	(calibration_target instrument8 GroundStation13)
	(calibration_target instrument8 Star48)
	(supports instrument9 thermograph1)
	(supports instrument9 spectrograph0)
	(calibration_target instrument9 Star28)
	(calibration_target instrument9 Star34)
	(calibration_target instrument9 GroundStation14)
	(calibration_target instrument9 GroundStation33)
	(calibration_target instrument9 GroundStation47)
	(calibration_target instrument9 GroundStation40)
	(calibration_target instrument9 Star26)
	(calibration_target instrument9 Star23)
	(calibration_target instrument9 Star18)
	(calibration_target instrument9 GroundStation32)
	(calibration_target instrument9 GroundStation13)
	(calibration_target instrument9 GroundStation27)
	(calibration_target instrument9 Star16)
	(calibration_target instrument9 GroundStation22)
	(calibration_target instrument9 GroundStation15)
	(on_board instrument6 satellite3)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(on_board instrument9 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star65)
	(supports instrument10 thermograph1)
	(supports instrument10 image4)
	(supports instrument10 spectrograph0)
	(calibration_target instrument10 GroundStation47)
	(calibration_target instrument10 GroundStation10)
	(calibration_target instrument10 GroundStation22)
	(calibration_target instrument10 GroundStation13)
	(calibration_target instrument10 Star9)
	(calibration_target instrument10 Star43)
	(calibration_target instrument10 Star5)
	(calibration_target instrument10 GroundStation17)
	(calibration_target instrument10 Star31)
	(calibration_target instrument10 Star20)
	(calibration_target instrument10 GroundStation27)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon83)
)
(:goal (and
	(pointing satellite0 Phenomenon73)
	(pointing satellite2 Star28)
	(pointing satellite3 Phenomenon70)
	(pointing satellite4 Star74)
	(have_image Planet50 infrared3)
	(have_image Planet51 thermograph1)
	(have_image Planet52 infrared3)
	(have_image Phenomenon53 infrared2)
	(have_image Planet54 infrared3)
	(have_image Star55 spectrograph0)
	(have_image Star56 infrared2)
	(have_image Planet57 infrared2)
	(have_image Planet58 infrared3)
	(have_image Planet59 thermograph1)
	(have_image Planet60 infrared3)
	(have_image Phenomenon61 infrared2)
	(have_image Star62 spectrograph0)
	(have_image Star63 spectrograph0)
	(have_image Phenomenon64 thermograph1)
	(have_image Star65 thermograph1)
	(have_image Planet66 spectrograph0)
	(have_image Star67 thermograph1)
	(have_image Planet68 infrared3)
	(have_image Phenomenon69 thermograph1)
	(have_image Phenomenon70 image4)
	(have_image Star71 infrared3)
	(have_image Phenomenon72 spectrograph0)
	(have_image Phenomenon73 thermograph1)
	(have_image Star74 infrared2)
	(have_image Planet75 thermograph1)
	(have_image Phenomenon76 infrared3)
	(have_image Star77 spectrograph0)
	(have_image Planet78 image4)
	(have_image Planet79 infrared3)
	(have_image Phenomenon80 infrared3)
	(have_image Star81 image4)
	(have_image Phenomenon82 spectrograph0)
	(have_image Phenomenon83 thermograph1)
	(have_image Phenomenon84 thermograph1)
))

)

; plan
1. (switch_on instrument10 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument10)
   goals met: 0 of 39
2. (switch_on instrument0 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument0)
   goals met: 0 of 39
3. (turn_to satellite3 phenomenon70 star65)
   deleted: (pointing satellite3 star65)
   added: (pointing satellite3 phenomenon70)
   goals met: 1 of 39
4. (turn_to satellite2 star28 star43)
   deleted: (pointing satellite2 star43)
   added: (pointing satellite2 star28)
   goals met: 2 of 39
5. (turn_to satellite0 phenomenon53 star0)
   deleted: (pointing satellite0 star0)
   added: (pointing satellite0 phenomenon53)
   goals met: 2 of 39
6. (turn_to satellite4 star9 phenomenon83)
   deleted: (pointing satellite4 phenomenon83)
   added: (pointing satellite4 star9)
   goals met: 2 of 39
7. (calibrate satellite4 instrument10 star9)
   added: (calibrated instrument10)
   goals met: 2 of 39
8. (turn_to satellite4 phenomenon64 star9)
   deleted: (pointing satellite4 star9)
   added: (pointing satellite4 phenomenon64)
   goals met: 2 of 39
9. (take_image satellite4 phenomenon64 instrument10 thermograph1)
   added: (have_image phenomenon64 thermograph1)
   goals met: 3 of 39
10. (turn_to satellite4 phenomenon69 phenomenon64)
   deleted: (pointing satellite4 phenomenon64)
   added: (pointing satellite4 phenomenon69)
   goals met: 3 of 39
11. (take_image satellite4 phenomenon69 instrument10 thermograph1)
   added: (have_image phenomenon69 thermograph1)
   goals met: 4 of 39
12. (turn_to satellite4 phenomenon70 phenomenon69)
   deleted: (pointing satellite4 phenomenon69)
   added: (pointing satellite4 phenomenon70)
   goals met: 4 of 39
13. (take_image satellite4 phenomenon70 instrument10 image4)
   added: (have_image phenomenon70 image4)
   goals met: 5 of 39
14. (turn_to satellite4 phenomenon72 phenomenon70)
   deleted: (pointing satellite4 phenomenon70)
   added: (pointing satellite4 phenomenon72)
   goals met: 5 of 39
15. (take_image satellite4 phenomenon72 instrument10 spectrograph0)
   added: (have_image phenomenon72 spectrograph0)
   goals met: 6 of 39
16. (turn_to satellite4 phenomenon73 phenomenon72)
   deleted: (pointing satellite4 phenomenon72)
   added: (pointing satellite4 phenomenon73)
   goals met: 6 of 39
17. (take_image satellite4 phenomenon73 instrument10 thermograph1)
   added: (have_image phenomenon73 thermograph1)
   goals met: 7 of 39
18. (turn_to satellite4 phenomenon82 phenomenon73)
   deleted: (pointing satellite4 phenomenon73)
   added: (pointing satellite4 phenomenon82)
   goals met: 7 of 39
19. (take_image satellite4 phenomenon82 instrument10 spectrograph0)
   added: (have_image phenomenon82 spectrograph0)
   goals met: 8 of 39
20. (turn_to satellite4 phenomenon83 phenomenon82)
   deleted: (pointing satellite4 phenomenon82)
   added: (pointing satellite4 phenomenon83)
   goals met: 8 of 39
21. (take_image satellite4 phenomenon83 instrument10 thermograph1)
   added: (have_image phenomenon83 thermograph1)
   goals met: 9 of 39
22. (turn_to satellite4 phenomenon84 phenomenon83)
   deleted: (pointing satellite4 phenomenon83)
   added: (pointing satellite4 phenomenon84)
   goals met: 9 of 39
23. (take_image satellite4 phenomenon84 instrument10 thermograph1)
   added: (have_image phenomenon84 thermograph1)
   goals met: 10 of 39
24. (turn_to satellite4 planet51 phenomenon84)
   deleted: (pointing satellite4 phenomenon84)
   added: (pointing satellite4 planet51)
   goals met: 10 of 39
25. (take_image satellite4 planet51 instrument10 thermograph1)
   added: (have_image planet51 thermograph1)
   goals met: 11 of 39
26. (turn_to satellite4 planet59 planet51)
   deleted: (pointing satellite4 planet51)
   added: (pointing satellite4 planet59)
   goals met: 11 of 39
27. (take_image satellite4 planet59 instrument10 thermograph1)
   added: (have_image planet59 thermograph1)
   goals met: 12 of 39
28. (turn_to satellite4 planet66 planet59)
   deleted: (pointing satellite4 planet59)
   added: (pointing satellite4 planet66)
   goals met: 12 of 39
29. (take_image satellite4 planet66 instrument10 spectrograph0)
   added: (have_image planet66 spectrograph0)
   goals met: 13 of 39
30. (turn_to satellite4 planet75 planet66)
   deleted: (pointing satellite4 planet66)
   added: (pointing satellite4 planet75)
   goals met: 13 of 39
31. (take_image satellite4 planet75 instrument10 thermograph1)
   added: (have_image planet75 thermograph1)
   goals met: 14 of 39
32. (turn_to satellite4 planet78 planet75)
   deleted: (pointing satellite4 planet75)
   added: (pointing satellite4 planet78)
   goals met: 14 of 39
33. (take_image satellite4 planet78 instrument10 image4)
   added: (have_image planet78 image4)
   goals met: 15 of 39
34. (turn_to satellite4 star55 planet78)
   deleted: (pointing satellite4 planet78)
   added: (pointing satellite4 star55)
   goals met: 15 of 39
35. (take_image satellite4 star55 instrument10 spectrograph0)
   added: (have_image star55 spectrograph0)
   goals met: 16 of 39
36. (turn_to satellite4 star62 star55)
   deleted: (pointing satellite4 star55)
   added: (pointing satellite4 star62)
   goals met: 16 of 39
37. (take_image satellite4 star62 instrument10 spectrograph0)
   added: (have_image star62 spectrograph0)
   goals met: 17 of 39
38. (turn_to satellite4 star63 star62)
   deleted: (pointing satellite4 star62)
   added: (pointing satellite4 star63)
   goals met: 17 of 39
39. (take_image satellite4 star63 instrument10 spectrograph0)
   added: (have_image star63 spectrograph0)
   goals met: 18 of 39
40. (turn_to satellite4 star65 star63)
   deleted: (pointing satellite4 star63)
   added: (pointing satellite4 star65)
   goals met: 18 of 39
41. (take_image satellite4 star65 instrument10 thermograph1)
   added: (have_image star65 thermograph1)
   goals met: 19 of 39
42. (turn_to satellite4 star67 star65)
   deleted: (pointing satellite4 star65)
   added: (pointing satellite4 star67)
   goals met: 19 of 39
43. (take_image satellite4 star67 instrument10 thermograph1)
   added: (have_image star67 thermograph1)
   goals met: 20 of 39
44. (turn_to satellite4 star74 star67)
   deleted: (pointing satellite4 star67)
   added: (pointing satellite4 star74)
   goals met: 21 of 39
45. (turn_to satellite4 star77 star74)
   deleted: (pointing satellite4 star74)
   added: (pointing satellite4 star77)
   goals met: 20 of 39
46. (take_image satellite4 star77 instrument10 spectrograph0)
   added: (have_image star77 spectrograph0)
   goals met: 21 of 39
47. (turn_to satellite4 star74 star77)
   deleted: (pointing satellite4 star77)
   added: (pointing satellite4 star74)
   goals met: 22 of 39
48. (turn_to satellite4 star81 star74)
   deleted: (pointing satellite4 star74)
   added: (pointing satellite4 star81)
   goals met: 21 of 39
49. (take_image satellite4 star81 instrument10 image4)
   added: (have_image star81 image4)
   goals met: 22 of 39
50. (turn_to satellite4 star74 star81)
   deleted: (pointing satellite4 star81)
   added: (pointing satellite4 star74)
   goals met: 23 of 39
51. (turn_to satellite0 star7 phenomenon53)
   deleted: (pointing satellite0 phenomenon53)
   added: (pointing satellite0 star7)
   goals met: 23 of 39
52. (calibrate satellite0 instrument0 star7)
   added: (calibrated instrument0)
   goals met: 23 of 39
53. (turn_to satellite0 phenomenon53 star7)
   deleted: (pointing satellite0 star7)
   added: (pointing satellite0 phenomenon53)
   goals met: 23 of 39
54. (take_image satellite0 phenomenon53 instrument0 infrared2)
   added: (have_image phenomenon53 infrared2)
   goals met: 24 of 39
55. (turn_to satellite0 phenomenon61 phenomenon53)
   deleted: (pointing satellite0 phenomenon53)
   added: (pointing satellite0 phenomenon61)
   goals met: 24 of 39
56. (take_image satellite0 phenomenon61 instrument0 infrared2)
   added: (have_image phenomenon61 infrared2)
   goals met: 25 of 39
57. (turn_to satellite0 phenomenon73 phenomenon61)
   deleted: (pointing satellite0 phenomenon61)
   added: (pointing satellite0 phenomenon73)
   goals met: 26 of 39
58. (turn_to satellite0 phenomenon76 phenomenon73)
   deleted: (pointing satellite0 phenomenon73)
   added: (pointing satellite0 phenomenon76)
   goals met: 25 of 39
59. (take_image satellite0 phenomenon76 instrument0 infrared3)
   added: (have_image phenomenon76 infrared3)
   goals met: 26 of 39
60. (turn_to satellite0 phenomenon73 phenomenon76)
   deleted: (pointing satellite0 phenomenon76)
   added: (pointing satellite0 phenomenon73)
   goals met: 27 of 39
61. (turn_to satellite0 phenomenon80 phenomenon73)
   deleted: (pointing satellite0 phenomenon73)
   added: (pointing satellite0 phenomenon80)
   goals met: 26 of 39
62. (take_image satellite0 phenomenon80 instrument0 infrared3)
   added: (have_image phenomenon80 infrared3)
   goals met: 27 of 39
63. (turn_to satellite0 phenomenon73 phenomenon80)
   deleted: (pointing satellite0 phenomenon80)
   added: (pointing satellite0 phenomenon73)
   goals met: 28 of 39
64. (turn_to satellite0 planet50 phenomenon73)
   deleted: (pointing satellite0 phenomenon73)
   added: (pointing satellite0 planet50)
   goals met: 27 of 39
65. (take_image satellite0 planet50 instrument0 infrared3)
   added: (have_image planet50 infrared3)
   goals met: 28 of 39
66. (turn_to satellite0 phenomenon73 planet50)
   deleted: (pointing satellite0 planet50)
   added: (pointing satellite0 phenomenon73)
   goals met: 29 of 39
67. (turn_to satellite0 planet52 phenomenon73)
   deleted: (pointing satellite0 phenomenon73)
   added: (pointing satellite0 planet52)
   goals met: 28 of 39
68. (take_image satellite0 planet52 instrument0 infrared3)
   added: (have_image planet52 infrared3)
   goals met: 29 of 39
69. (turn_to satellite0 phenomenon73 planet52)
   deleted: (pointing satellite0 planet52)
   added: (pointing satellite0 phenomenon73)
   goals met: 30 of 39
70. (turn_to satellite0 planet54 phenomenon73)
   deleted: (pointing satellite0 phenomenon73)
   added: (pointing satellite0 planet54)
   goals met: 29 of 39
71. (take_image satellite0 planet54 instrument0 infrared3)
   added: (have_image planet54 infrared3)
   goals met: 30 of 39
72. (turn_to satellite0 phenomenon73 planet54)
   deleted: (pointing satellite0 planet54)
   added: (pointing satellite0 phenomenon73)
   goals met: 31 of 39
73. (turn_to satellite0 planet57 phenomenon73)
   deleted: (pointing satellite0 phenomenon73)
   added: (pointing satellite0 planet57)
   goals met: 30 of 39
74. (take_image satellite0 planet57 instrument0 infrared2)
   added: (have_image planet57 infrared2)
   goals met: 31 of 39
75. (turn_to satellite0 phenomenon73 planet57)
   deleted: (pointing satellite0 planet57)
   added: (pointing satellite0 phenomenon73)
   goals met: 32 of 39
76. (turn_to satellite0 planet58 phenomenon73)
   deleted: (pointing satellite0 phenomenon73)
   added: (pointing satellite0 planet58)
   goals met: 31 of 39
77. (take_image satellite0 planet58 instrument0 infrared3)
   added: (have_image planet58 infrared3)
   goals met: 32 of 39
78. (turn_to satellite0 phenomenon73 planet58)
   deleted: (pointing satellite0 planet58)
   added: (pointing satellite0 phenomenon73)
   goals met: 33 of 39
79. (turn_to satellite0 planet60 phenomenon73)
   deleted: (pointing satellite0 phenomenon73)
   added: (pointing satellite0 planet60)
   goals met: 32 of 39
80. (take_image satellite0 planet60 instrument0 infrared3)
   added: (have_image planet60 infrared3)
   goals met: 33 of 39
81. (turn_to satellite0 phenomenon73 planet60)
   deleted: (pointing satellite0 planet60)
   added: (pointing satellite0 phenomenon73)
   goals met: 34 of 39
82. (turn_to satellite0 planet68 phenomenon73)
   deleted: (pointing satellite0 phenomenon73)
   added: (pointing satellite0 planet68)
   goals met: 33 of 39
83. (take_image satellite0 planet68 instrument0 infrared3)
   added: (have_image planet68 infrared3)
   goals met: 34 of 39
84. (turn_to satellite0 phenomenon73 planet68)
   deleted: (pointing satellite0 planet68)
   added: (pointing satellite0 phenomenon73)
   goals met: 35 of 39
85. (turn_to satellite0 planet79 phenomenon73)
   deleted: (pointing satellite0 phenomenon73)
   added: (pointing satellite0 planet79)
   goals met: 34 of 39
86. (take_image satellite0 planet79 instrument0 infrared3)
   added: (have_image planet79 infrared3)
   goals met: 35 of 39
87. (turn_to satellite0 phenomenon73 planet79)
   deleted: (pointing satellite0 planet79)
   added: (pointing satellite0 phenomenon73)
   goals met: 36 of 39
88. (turn_to satellite0 star56 phenomenon73)
   deleted: (pointing satellite0 phenomenon73)
   added: (pointing satellite0 star56)
   goals met: 35 of 39
89. (take_image satellite0 star56 instrument0 infrared2)
   added: (have_image star56 infrared2)
   goals met: 36 of 39
90. (turn_to satellite0 phenomenon73 star56)
   deleted: (pointing satellite0 star56)
   added: (pointing satellite0 phenomenon73)
   goals met: 37 of 39
91. (turn_to satellite0 star71 phenomenon73)
   deleted: (pointing satellite0 phenomenon73)
   added: (pointing satellite0 star71)
   goals met: 36 of 39
92. (take_image satellite0 star71 instrument0 infrared3)
   added: (have_image star71 infrared3)
   goals met: 37 of 39
93. (turn_to satellite0 phenomenon73 star71)
   deleted: (pointing satellite0 star71)
   added: (pointing satellite0 phenomenon73)
   goals met: 38 of 39
94. (turn_to satellite0 star74 phenomenon73)
   deleted: (pointing satellite0 phenomenon73)
   added: (pointing satellite0 star74)
   goals met: 37 of 39
95. (take_image satellite0 star74 instrument0 infrared2)
   added: (have_image star74 infrared2)
   goals met: 38 of 39
96. (turn_to satellite0 phenomenon73 star74)
   deleted: (pointing satellite0 star74)
   added: (pointing satellite0 phenomenon73)
   goals met: 39 of 39
